web_application_developmennt/ruby_on_rails_angularjs/rails-angular-tutorial-master/part-2/app/controllers/posts_controller.rb

  def index

    # Retrieve all Post data
    posts = Post.all
---
SELECT "posts".* FROM "posts"